	    #+TITLE: Science Research Cybersecurity Notes
*** DONE [#A] Literature review about becoming a pentester          :nobrain:
    CLOSED: [2020-12-07 Mon 20:41]
    :PROPERTIES:
    :ID:       15b31993-bfaf-451f-a879-baece64763b7
    :EXPORT_FILE_NAME: literatureReview-RedTeamSecurity-BecomingAPentester
    :END:
    :BACKLINKS:
    [2020-12-06 Sun 19:24] <- [[id:80e18ae4-c8fd-4d5b-b28a-04b4d7a78194][Daily log]]
    :END:
    :LOGBOOK:
    CLOCK: [2020-12-07 Mon 20:01]--[2020-12-07 Mon 20:04] =>  0:03
    CLOCK: [2020-12-07 Mon 18:43]--[2020-12-07 Mon 19:20] =>  0:37
    CLOCK: [2020-12-07 Mon 17:13]--[2020-12-07 Mon 17:53] =>  0:40
    CLOCK: [2020-12-07 Mon 14:00]--[2020-12-07 Mon 14:32] =>  0:32
    CLOCK: [2020-12-06 Sun 19:45]--[2020-12-06 Sun 20:30] =>  0:45
    CLOCK: [2020-12-05 Sat 19:54]--[2020-12-05 Sat 20:07] =>  0:13
    :END:
    - Link: [[https://www.redteamsecure.com/blog/how-to-become-a-penetration-tester/][RedTeam Security Article]]
** DONE [#C] OSI model notes (from CS/N ppt)                :homework:school:
   CLOSED: [2020-12-21 Mon 19:50] DEADLINE: <2020-12-21 Mon>
   :PROPERTIES:
   :Effort:   0:45
   :ID:       1637ad1f-039c-4cfc-aa57-813cc1033003
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-21 Mon 17:12]--[2020-12-21 Mon 17:12] =>  0:00
   CLOCK: [2020-12-20 Sun 18:34]--[2020-12-20 Sun 19:13] =>  0:39
   :END:
** DONE Odin Project: How the web works (notes)                    :homework:
   CLOSED: [2020-12-18 Fri 09:45] DEADLINE: <2020-12-18 Fri>
   :PROPERTIES:
   :ID:       58c16e19-cd37-427b-b4a6-0a3dea754875
   :END:
   :BACKLINKS:
   [2020-12-19 Sat 20:15] <- [[id:80e18ae4-c8fd-4d5b-b28a-04b4d7a78194][Daily log]]
   [2020-12-19 Sat 20:14] <- [[id:80e18ae4-c8fd-4d5b-b28a-04b4d7a78194][Daily log]]
   :END:
   :LOGBOOK:
   CLOCK: [2020-12-18 Fri 09:41]--[2020-12-18 Fri 09:46] =>  0:05
   CLOCK: [2020-12-14 Mon 14:05]--[2020-12-14 Mon 16:03] =>  1:58
   :END:
   - Link: [[https://www.theodinproject.com/courses/foundations/lessons/how-does-the-web-work][Odin Project]]
